// ここから10個のテーマ配列
'use strict';

const information = [
  {
    theme: '①　仲間の居場所つくらずして自分の居場所なし',
    img: './assets/img/speech-1.svg',
    name: '3.0 塚越雄真',
    message: 
    `居場所を作るとは、弱みや欠点も受け入れ素で話し合える関係を築くことだと考えます。
    このような考えに至った経緯を私自身の経験に沿って話したいと思います。
    私は今までバスケや駅伝といったチームスポーツを経験してきました。
    その活動の中で、モチベーションは高いが上手くチームに溶け込むことができない仲間がいたため、相談に乗るといくつか本音が見えてきました。
    それは、、、
    ・バスケは好きだけど、ミスばっかりでチームに迷惑かけているから…
    ・内向的でコミュニケーションとるのが苦手だから…
    ・キツくなるとあきらめてしまう性格だから…
    といった自分にとってマイナスの条件をつけて自分の居場所を見失っていたのでした。
    つまり、「自分の中に弱い部分はあってはいけない」という心の状態を、「チームの中に弱い自分はいてはいけない」という居場所のない現実に投影していたのです。
    後日、その弱みをどうしたら強みにすることができるのか解決策を他のチームメイトで考え、普段の生活や練習でも実行していきました。
    その結果、仲間は弱みも受け入れてくれる環境に居場所を感じ、生き生きと一緒にバスケ人生を送ることができました。
    このように、仲間の居場所を作ること  =>  素で話し合える仲間の”一員”としての居場所、同じ目標を掲げた”一員”としての居場所　といった自分の居場所もそれに伴って確立していくと考えます。
    上記の経験は今後のチーム開発でも同様のことが言えると思います。
    自分の弱みを弱みと思わず、打ち明けることで受け入れてくれる仲間がPOSSEにはたくさんいます。
    そして、よこもくやたてもく、かださぽといった悩みや不安を受け入れてくれる先輩方や同期、信頼を置くことのできる”居場所”があります。
    したがって、仲間の居場所というのはすでにPOOSEにはたくさん作られていると思います。
    これからは人とつながる機会をより一層大事にし、安心して居られる居場所作りをハッカソンなどを通して作り上げていきたいです。`
  },
  {
    theme: '②　ふりかえり主義',
    img: './assets/img/11955_color.svg',
    name: '2.0 藤吉彩花',
    message:
    `ついつい考え過ぎてしまう私が振り返りをすることで前向きになれたので、そのことについて話したいと思います。
    みなさんも、自分の前に壁が現れた時、何故自分は乗り越えられないのか、どう対処していけばいいのか考えると思います。その時に私は焦りや悔しい気持ちで、闇雲に進もうとし、しかし進んだ先には違う壁があり、自分なりに努力をしているつもりなのに上手くいかないというジレンマに陥りました。
    この時に振り返りが必要で、特に大事なのが言語化です。漠然とした問題点があると、肥大化して見えがちですが、きちんと文字に書き起こしてみると、物事を大きく捉え過ぎていたことに気づき、案外落ち着くことが多いのではないでしょうか。
    
    実際にチーム開発中にこの経験をしました。コードを複数試してもわからないためメンターさんに質問しよう、という時に、何がわからないのかがわからない状態にいたことに気がつきました。そこで一度立ち止まり言語化したことで、どこが足りなかったかが分かり、その時は自分で問題点を発見できて解決でき、自分でも気付くことができたという自信につながりました。一つ一つ自分の思い浮かべているやりたいことと、実際に起きていることの現象をきちんと言語化して、物事を正しく認識することの大事さを学びました。
    今回はコード面で例を話しましたが、人間関係やチームビルディング面でもこうした言語化の振り返りはとても有効だと考えます。
    また、こうした振り返りは物事の最後ではなく、次に進みたいと思う度に行うべきで、授業の復習をテスト前に一度にするときつくなるのと同じだと思います。
    まとめると、振り返りはネガティブ思考をポジティブ思考に変換するきっかけになり、
    なんで出来なかったんだろう…を言語化して原因見つけ、次からこうしようと前向きになれるので、問題を肥大化させる前に定期的に振り返りをしていくのが大事です。`
  },
  {
    theme: '③　インサイドアウト',
    img: './assets/img/7674_color.svg',
    name: '2.0 古屋美羽',
    message:
    `「インサイドアウトとは、一言で言えば、自分自身の内面から始めるという意味である。」七つの習慣ではこう書かれています。
    先日終了したチーム開発での出来事をもとにこのテーマについてスピーチします。
    チーム開発中は2ヶ月間ずっと高いモチベーションを維持できたわけではありませんでした。
    開発期間の中間にチームで話し合った時、感情論で話した私に対し、メンバーはそう思った理由が知りたいと言いました。真っ当な事を言ってくれたのですが、その時の私は自分自身を見つめ直すことをせず、メンバーに対して論理的に考えることが出来ないと言い切り、メンバーが柔軟に対応してくれる事を求めました。
    今思うと、インサイドアウトのアプローチをできていないこの時に1番モチベーションが低かったです。
    チームでの「公的成功を果たすためには、まず自分自身を制する私的成功を果たさなくてはならない。」
    私は今回、アウトサイドインの考えをして、相手の変化を求めてしまいました。
    何故その時、自分の行動から変えられなかったのか、心残りに感じています。
    今後同じことを繰り返さないように、今週1週間の振り返り期間をもって考え直したいと思います。`
  },
  {
    theme: '④　理解してから理解される',
    img: './assets/img/13618_color.svg',
    name: '2.0 千羽茉莉愛',
    message:
    `理解という言葉の意味について調べてみたのですが、理解には「内容、意味などがわかること」の他に「相手の気持ちや立場に立って思いやること」という意味も含まれています。
    私は普段理解という言葉を使うときに、1個目の内容、意味などがわかるという方は意識していますが、2個目の相手の立場に立って思いやるという方は理解という言葉の定義に含まれてると思っていなかったのでびっくりしました。
    そして私は相手の立場に立つためにはまずは相手のことをよく知ることが必須だと思っています。そしてそのためには、なによりも傾聴が大事だと思っています。
    最近、よりそう強く感じた出来事があったので、共有させてもらいます。
    私は今新人ハッカソン運営をしているのですが、この間あるメンバーとあることについてバチバチに意見がぶつかってしまいました。初めその人の意見を聞いたときは、あまりにも自分の価値観と違っているように聞こえて、理解できないと思ってしまいました。しかし、それでは良くないと思い、どうしてそう思ったのかなど相手の考えを深ぼることを意識してみました。すると、「自分の価値観と正反対だ」と思ったはずの相手の意見がむしろ自分と同じような価値観からでたものだとわかり、「理解できない」と思っていたはずがいつのまにか「めちゃくちゃ理解できるし、超素敵な意見だ」と思うようになりました。
    また、今改めて思い返すと、相手と対立していたときは理解してもらおうという気持ちが自分の中からなくなっていたことに気がつきました。相手を理解できないと思い、ここまで違う考えの持ち主だからきっと自分の考えも理解してもらえないと思い込んでしまっていました。
    私はこのことから、相手と理解し合うためには、理解できないと決めつけるのではなくて、お互いに相手を理解できる！し理解したい！と思って相手の話を傾聴することがとても重要だと思いようになりました。`
  },
  {
    theme: '⑤　深堀力は人格力',
    img: './assets/img/13610_color.svg',
    name: '2.5 福場脩真',
    message:
    `深ぼるとか、深い話とか、何を持って「深い」なのか、考えて使っているか？
    安易にこういった言葉を使ってしまうと、中身が伴ってないのに自分の考えを正当化してしまう。
    では深ぼるとは？
    事実を要素ごとに分解して、全体の構造を理解する作業のこと。
    例えば今、KDDIの通信障害が起こっているが、「早く復旧しろよ仕事どうなるんだよ」とか「自分は巻き込まれなくて良かったー」という人は思考停止しており、
    一方で「なぜ通信障害が起こっているのか？この騒動で人口の何割が被害を受けているのだろう？
    そもそもauやuq mobileを使用している人って何%だろう」「今回の騒動を機に今後どのような対策がなされるのだろう」
    「そもそも通信てどんな仕組みだっけ」と考えを巡らせられる人は深く考えられているといえるだろう。
    この能力を持つ人が人格者かどうかはわからない、人生で約に立つことは間違い無いだろう。
    では因数分解ができるには、どんな能力が必要だろか。私は、数学が特に重要だと考えます。複雑なものごとを分解し、簡略化するには抽象的な議論が不可欠です。
    そしてあらゆる事象を数式に置き換えて議論する数学は、抽象化の最たるものです。数学は理系の人だけのものではありません。`
  },
  {
    theme: '⑥　嘘をつかないごまかさない',
    img: './assets/img/14038_color.svg',
    name: '2.0 窪田美怜',
    message:
    `嘘をつかない、ごまかさない
    ＝(自分に対して)自分の感情に正直に生きる
        (今回の私が話すテーマ)
    ＝(他人に対して)誠実である、信用を無くさない為に大切
    〈状況〉
    4ヶ月の春休み、POSSE活動・スキー・長期インターン色んな事に追われてた
    新学期、授業やチーム開発始まる
    →絶対回らない！！
    周りも頑張って努力してる、自分も頑張らなきゃ
    全て自分が楽しみたい・挑戦したいと思って始めたこと
    ・周りに好きって明言する
    ・やり切ったら後悔がない
    →自信を持って言えなくなってるという気づき
    〈やったこと〉
    自分の感情としっかり向き合う
    各活動の必要性や自分にとっての重要性を考える
    →全ての活動に自分が自信もって望める所まで物事の数を減らす
    〈結果〉
    心機一転:自分の純粋な気持ちに向かって突き進む
    自分の自信を取り戻せた
    〈まとめ〉
    最近の私、また「嘘をつかない、ごまかさない」実践できてないのでは？
    改めて自分自身を見つめ直したい
    大切だと感じていること：自分の感情に正直に生きる`
  },
  {
    theme: '⑦　教えることは教わること',
    img: './assets/img/12451_color.svg',
    name: '1.0 林千翼子',
    message:
    `私の中の「教える」の概念を紹介します
    P：教えるとは、相手に「できる」ようにすること、わかってもらうだけじゃだめ
    R：知る、わかる、できる、教える
    E：https://globis.jp/article/5149
    　・インプット教材は「知る」
    　・quizy/websiteは「わかる」
    　・webappやハッカソンは「できる」
    P：教えるとは、相手に「できる」ようにすること、わかってもらうだけじゃだめ
    　　教える時は、「わかった？」じゃなくて、「じゃあやってみよう」でできるかどうかまでみてあげよう`
  },
  {
    theme: '⑧　「ベンチ行かない？」と言う勇気',
    img: './assets/img/13206_color.svg',
    name: '3.0 三木咲乃',
    message:
    `今回のテーマが「ベンチ行かない？」という勇気という事で、この事の重要さを実感した実体験を紹介したいと思います。
    それは私が高1の時に参加したモノコトイノベーションという、デザイン思考について学び、わずか5日間でモノ・コトを作るというコンテストの事でした。参加者は個人で応募し、ランダムにグループ分けされるため、お互いについて知る事もままならないままグループワークをしていくことになります。そんな中、他の人に尋ねられても自分の考えをはっきりと言えない子がグループに居、いつからかその子とすれ違ってしまっていました。4日目で次の日の最終発表に向けてその子の意見をしっかり聞きたいし、聞くべきだと思った私を含む他3人で色々尋ねてみたところ、その子は泣き出してしまいました。そこでmファシリテーターの配慮で全体のミーティングをすっぽかさせてもらい、近場のカフェでみんなで特大パフェを食べ、息抜きをさせてもらいました。一旦課題から離れ、一緒に楽しむことで今まで作ることができていなかった、人としての対話ができ、特別重要な事を話し合った訳ではありませんが、これがあったおかげで皆んなの心が一つになり、最終的に全員が納得いくものが発表できました。
    ベンチに行こう、と言う言葉は、時間があまりない時や心に余裕がない時にこそ必要にも関わらずなかなか言い出せない事だと思います。ベンチに行こうと言い、何か特別な事を言わなければならない、とは限らないと私はこの体験を通して思いました。ただ、ベンチに行き、本人が切り替えられるきっかけを作ってあげる事が重要であると思うので、もっと気軽に声をかけるべきだと思いました。`
  },
  {
    theme: '⑨　本音の対話なくして最高のチームなし',
    img: './assets/img/15070_color.svg',
    name: '3.0 井上岳',
    message:
    `チームとしての活動が終わってもメンバーでの交流があったり、思い出話をするようなチームが最高のチームだと思う。
    最高のチームとは？
    →一番思い出や印象が濃いチーム
    思い出や印象が濃いというのは、いかに感情が動かされるかによると思う。
    相手の感情を動かしたり、感情が動かされたりするためには本音の対話が必要。よって、本音の対話なくして最高のチームなしだと思う。
    どうやったら本音の対話ができるのか。
    本音が出る時は相手を信頼しているときなので、
    信頼していれば本音が出て、本音が出れば信頼関係が
    生まれて、また本音が出るという良い循環が生まれる。
    よって、信頼が本音での対話のポイントになる。
    結論としては、自分が相手を信頼すること、または相手に信頼されるような人であることが本音の対話をする第一歩だと思う。
    みんながその意識をすれば、どこかから本音が出てくるので自然と本音の対話が進んで、最高のチームができると思う。
    相手を信頼する、信頼されるようになる方法は今後の人格学習で身につけていきたい。
    日菜さんの、本音の対話にはコミュ量を確保することが大事という考えがとてもしっくりきた。ありがとうございます。`
  },
  {
    theme: '⑩　自ら機会を作り出し、機会によって自らを変えよ',
    img: './assets/img/12981_color.svg',
    name: '3.0 生川美羽',
    message:
    `「自ら機会を創り出し、機会によって自らを変えよ」というテーマをファシリ講座や私の実体験で感じたことを基に話していきたいと思います。
    　まず、自ら機会を創り出すとはどういうことなのか自分なりに考えてみました。それは主体的に動くということです。これには自分に責任が伴いますが、自立することに繋がると思います。それと逆のことは受動的、反応的になるということです。他人に依存し、失敗しても他人に責任を押し付けることが可能となります。
    　自ら機会を創り出すことをためらう理由はいろいろあると思います。
    　お金がない
    　忙しい
    　失敗したくない
    　負担、責任を負いたくない
    　現状のままで居心地がいい
    などです。
    機会があっても機会を見送ってしまうことは少なくありません。私も周りの反応を気にしすぎて意見を言わない理由を探して何も発言しないということがあります。しかし、これでは自分の意志を持つこともできず、他人に振り回されるだけで成長にはつながらないと思います。
    　posseにはミートアップ、縦モク、横モク、リアイベなど多くのプログラミングを学んだり、仲間と仲を深められる機会が提供されています。しかし、その機会を活用できるかは自分次第です。活用すれば、プログラミングの技術が向上したり、自分の人格を振り返って、自分が今後何をしたら人間として成長できるかを考えることができます。しかし、その機会を逃せば、ただコミュニティに所属するだけとなってしまいます。
    自分から横モクの日程を提案する、縦モク、横モク以外の時間以外でも誰かを誘ってプログラミングを学習するなど、小さなことから自ら機会を創り出して成長していきたいと思いました。`
  },
  
  
];

console.log(information[1].message)





const speech = document.getElementById('mainContent')


for (let i = 0; i < information.length; i++) {
  let speechHTML = `<div class="main-content">`
+   `<div class="main-theme" id="mainTheme"  data-theme = "${i}"><p>${information[i].theme}</p></div>`  
+  `</div>`
+  `<div class="main-speech-inner" id="mainSpeech${i}">`
+    `<div class="main-speech-box">`
+      `<div class="main-speech-people">`
+        `<div class="main-speech-img"><img src="${information[i].img}" alt="face"></div>`
+        `<p class="main-speech-name">${information[i].name}</p>`
+      `</div>`
+      `<div class="main-speech-wrapper">`
+        `<div class="main-speech-comment">`
+                `<p>${information[i].message}</p>`
+        `</div>`
+        `<button class="main-good-btn">いいね</button>`
+      `</div>`
+    `</div>`    
+  `</div>`;
speech.insertAdjacentHTML("beforeend",speechHTML)

}


const main = document.querySelectorAll('.main-theme');

main.forEach(mainitem =>{
  
  mainitem.addEventListener('click', ()=>{
    let selectedTheme = mainitem.getAttribute('data-theme');
    console.log(selectedTheme)
    let speechbox = document.getElementById(`mainSpeech${selectedTheme}`);
    speechbox.style.display = 'block';

  });

}
);
